#Использовать asserts
#Использовать tempfiles
#Использовать "utils"
#Использовать "../.."

#Область ОписаниеПеременных

Перем НакопленныеВременныеФайлы;

#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс

&Тест
Процедура ТестДолжен_СоздатьПустуюФайловуюБазуIbcmd() Экспорт

	// Дано
	Исполнитель = Новый Тест_ИсполнительКоманд("init-dev");
	Исполнитель.ДобавитьПараметр("--ibconnection", "/F./build/ib");
	Исполнитель.ДобавитьФлаг("--ibcmd");

	// Когда
	Исполнитель.ВыполнитьКоманду();

	// Тогда
	Исполнитель.ОжидаемЧтоВыводСодержит("Используется ibcmd");
	Исполнитель.ОжидаемЧтоВыводСодержит("Создали базу данных для");
		
КонецПроцедуры

&Тест
Процедура ТестДолжен_СоздатьФайловуюБазуИзИсходниковIbcmd() Экспорт

	// Дано
	Исполнитель = Новый Тест_ИсполнительКоманд("init-dev");
	Исполнитель.ДобавитьПараметр("--ibconnection", "/F./build/ib");
	КаталогSrc = Исполнитель.ПутьТестовыхДанных("cf");

	Исполнитель.ДобавитьПараметр("--src", КаталогSrc);
	Исполнитель.ДобавитьФлаг("--ibcmd");

	// Когда
	Исполнитель.ВыполнитьКоманду();

	// Тогда
	Исполнитель.ОжидаемЧтоВыводСодержит("Используется ibcmd");
	Исполнитель.ОжидаемЧтоВыводСодержит("Создана информационная база из исходников.");
	
КонецПроцедуры

&Тест
Процедура ТестДолжен_СоздатьФайловуюБазуИзФайлаВыгрузкиIbcmd() Экспорт

	// Дано
	Исполнитель = Новый Тест_ИсполнительКоманд("init-dev");
	ФайлDt = Исполнитель.ПутьТестовыхДанных("1Cv8.dt");
	Исполнитель.ДобавитьПараметр("--ibconnection", "/F./build/ib");
	Исполнитель.ДобавитьПараметр("--dt", ФайлDt);
	Исполнитель.ДобавитьФлаг("--ibcmd");

	// Когда
	Исполнитель.ВыполнитьКоманду();

	// Тогда
	Исполнитель.ОжидаемЧтоВыводСодержит("Используется ibcmd");
	Исполнитель.ОжидаемЧтоВыводСодержит("Создана информационная база из файла выгрузки.");
	
КонецПроцедуры

&Тест
Процедура ТестДолжен_СоздатьФайловуюБазуИзФайлаКонфигурацииIbcmd() Экспорт

	// Дано
	Исполнитель = Новый Тест_ИсполнительКоманд("init-dev");
	ФайлCf = Исполнитель.ПутьТестовыхДанных("1cv8.cf");
	Исполнитель.ДобавитьПараметр("--ibconnection", "/F./build/ib");
	Исполнитель.ДобавитьПараметр("--cf", ФайлCf);
	Исполнитель.ДобавитьФлаг("--ibcmd");

	// Когда
	Исполнитель.ВыполнитьКоманду();

	// Тогда
	Исполнитель.ОжидаемЧтоВыводСодержит("Используется ibcmd");
	Исполнитель.ОжидаемЧтоВыводСодержит("Создана информационная база из файла конфигурации.");
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытий

Процедура ПередЗапускомТеста() Экспорт
	
	НакопленныеВременныеФайлы = ВременныеФайлы.Файлы();
	
КонецПроцедуры

Процедура ПослеЗапускаТеста() Экспорт
	
	ВременныеФайлы.УдалитьНакопленныеВременныеФайлы(НакопленныеВременныеФайлы);
	
КонецПроцедуры

#КонецОбласти
