#Использовать asserts
#Использовать tempfiles
#Использовать "utils"
#Использовать "../.."

#Область ОписаниеПеременных

Перем НакопленныеВременныеФайлы; // фиксация накопленных времнных файлов для сброса

#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс

&Тест
Процедура ТестДолжен_ЗагузитьРасширениеИзФайлаIbcmd() Экспорт

	// Дано
	Исполнитель = Новый Тест_ИсполнительКоманд("loadext");
	Исполнитель.УстановитьКонтекстПустаяИБ();
	ФайлCfe = Исполнитель.ПутьТестовыхДанных("test.cfe");
	Исполнитель.ДобавитьПараметр("--file", ФайлCfe);
	Исполнитель.ДобавитьПараметр("--extension", "test");
	Исполнитель.ДобавитьФлаг("--ibcmd");
	
	// Когда
	Исполнитель.ВыполнитьКоманду();

	// Тогда
	Исполнитель.ОжидаемЧтоВыводСодержит("Используется ibcmd");
	Исполнитель.ОжидаемЧтоВыводСодержит("Загрузка расширения из cfe завершена.");
		
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытий

Процедура ПередЗапускомТеста() Экспорт
	
	НакопленныеВременныеФайлы = ВременныеФайлы.Файлы();
	
КонецПроцедуры

Процедура ПослеЗапускаТеста() Экспорт
	
	ВременныеФайлы.УдалитьНакопленныеВременныеФайлы(НакопленныеВременныеФайлы);
	
КонецПроцедуры

#КонецОбласти
