#Использовать asserts
#Использовать tempfiles
#Использовать "utils"
#Использовать "../.."

#Область ОписаниеПеременных

Перем НакопленныеВременныеФайлы; // фиксация накопленных времнных файлов для сброса

#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс

&Тест
Процедура ТестДолжен_ОбновитьРасширение() Экспорт

	// Дано
	Исполнитель = Новый Тест_ИсполнительКоманд("updateext");
	Исполнитель.УстановитьКонтекстПустаяИБ();
	Исполнитель.СоздатьПустоеРасширение("test", "Ext1_");
	Исполнитель.ДобавитьПараметр("test");
	
	// Когда
	Исполнитель.ВыполнитьКоманду();

	// Тогда
	Исполнитель.ОжидаемЧтоВыводСодержит("Используется версия платформы");
	Исполнитель.ОжидаемЧтоВыводСодержит("Обновление базы данных расширения завершено.");
		
КонецПроцедуры

&Тест
Процедура ТестДолжен_ОбновитьРасширениеIbcmd() Экспорт

	// Дано
	Исполнитель = Новый Тест_ИсполнительКоманд("updateext");
	Исполнитель.УстановитьКонтекстПустаяИБ();
	Исполнитель.СоздатьПустоеРасширение("test", "Ext1_");
	Исполнитель.ДобавитьПараметр("test");
	Исполнитель.ДобавитьФлаг("--ibcmd");
	
	// Когда
	Исполнитель.ВыполнитьКоманду();

	// Тогда
	Исполнитель.ОжидаемЧтоВыводСодержит("Используется ibcmd");
	Исполнитель.ОжидаемЧтоВыводСодержит("Обновление базы данных расширения завершено.");
		
КонецПроцедуры


#КонецОбласти

#Область ОбработчикиСобытий

Процедура ПередЗапускомТеста() Экспорт
	
	НакопленныеВременныеФайлы = ВременныеФайлы.Файлы();
	
КонецПроцедуры

Процедура ПослеЗапускаТеста() Экспорт
	
	ВременныеФайлы.УдалитьНакопленныеВременныеФайлы(НакопленныеВременныеФайлы);
	
КонецПроцедуры

#КонецОбласти
